from .utils import resource_path

TEMPLATE_NAME = "ผู้ใหญ่ใจดี"
TEMPLATE_IMAGE = resource_path("assets/pic/ใบแนวทางโชคดี.jpg")
TEMPLATE_ORDER = 3

POSITIONS = [
    (880, 400, 'TITLE'),
    (900, 2150, 'CLOSING_TIME'),
    (880, 200, 'DATE'),
    (880, 600, 5),
    (380, 1040, 1), (1370, 1040, 1),
    (390, 1380, 2), (900, 1380, 2), (1370, 1380, 2),
    (390, 1660, 2), (900, 1660, 2), (1370, 1660, 2),
    (390, 1970, 3), (880, 1970, 3), (1370, 1970, 3)
] 

# ขนาดฟอนต์ที่ใช้ (TITLE, DATE, FIVE, ONE, TWO, THREE, CLOSING)
FONT_SIZES = {
    "TITLE": 100,
    "CLOSING": 50,
    "DATE": 80,
    "FIVE": 140,
    "ONE": 240,
    "TWO": 140,
    "THREE": 140
}

# ตัวแปรเสริม (ถ้ามีการใช้ขนาดภาพเฉพาะของ template นี้)
OUTPUT_WIDTH = 1410
OUTPUT_HEIGHT = 2000

LOTTO_LIST = [
    "ลาววันใหม่ ปิดรับ 07.50 น.",
    "ฮานอยเช้า ปิดรับ 08.10 น.",
    "ลาวเช้า ปิดรับ 08.50 น.",
    "ฮานอยท้องถิ่น ปิดรับ 09.10 น.",
    "หุ้นนิเคอิเช้า+พิเศษ ปิดรับ 09.20 น.",
    "ลาวเศรษฐกิจ ปิดรับ 10.00 น.",
    "หุ้นจีนเช้า+พิเศษ ปิดรับ 10.05 น.",
    "หุ้นฮั่งเส็งเช้า+พิเศษ ปิดรับ 10.50 น.",
    "ลาวดีเดย์ ปิดรับ 11.00 น.",
    "หุ้นไต้หวัน+พิเศษ ปิดรับ 12.00 น.",
    "ลาวเที่ยง ปิดรับ 12.20 น.",
    "หุ้นเกาหลี+พิเศษ ปิดรับ 12.40 น.",
    "หุ้นนิเคอิบ่าย+พิเศษ ปิดรับ 12.50 น.",
    "ลาวดิจิตอล ปิดรับ 13.20 น.",
    "หุ้นจีนบ่าย+พิเศษ ปิดรับ 13.30 น.",
    "ฮานอยไชโย ปิดรับ 14.10 น.",
    "หุ้นฮั่งเส็งบ่าย+พิเศษ ปิดรับ 14.50 น.",
    "ลาวร่วมใจ ปิดรับ 15.20 น.",
    "หุ้นสิงค์โปร์+พิเศษ ปิดรับ 15.45 น.",
    "ฮานอยเดย์ ปิดรับ 16.10 น.",
    "หุ้นอินเดีย ปิดรับ 16.30 น.",
    "หุ้นอียิปต์ ปิดรับ 17.50 น.",
    "ลาวพิเศษ ปิดรับ 19.45 น.",
    "ลาววิลล่า ปิดรับ 20.00 น.",
    "หุ้นมาเลย์เซีย ปิดรับ 20.40 น.",
    "ลาวนคร ปิดรับ 20.50 น.",
    "ลาวรุ่งเรือง ปิดรับ 21.20 น.",
    "ลาว VIP ปิดรับ 21.20 น.",
    "ฮานอยรอบดึก ปิดรับ 22.00 น.",
    "หุ้นรัสเซีย+อังกฤษ+เยอรมัน",
    "ลาวทูไนท์ ปิดรับ 23.00 น.",
    "รวมดาว",
    "หุ้นแคนาดา ปิดรับ 23.35 น."
]